#  Pandas基础

## 文件读取

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'1.0.3'

In [3]:
np.__version__

'1.18.1'

In [4]:
import os

In [5]:
df = pd.read_csv('data/table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [6]:
df_excel = pd.read_excel('data/table.xlsx')
df_excel.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

## 基本数据结构

### Series

#### 对于一个Series，其中最常用的属性为值（values），索引（index），名字（name），类型（dtype）

In [7]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name='创建Series',dtype='float64')
s

a   -0.051237
b    0.512724
c   -1.327402
d   -1.168272
e    0.224744
Name: 创建Series, dtype: float64

In [8]:
s.values

array([-0.05123671,  0.51272441, -1.32740225, -1.16827222,  0.22474419])

In [9]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

取出元素

In [10]:
s['a']

-0.05123670638898495

In [11]:
s.mean()

-0.36188851284941126

In [12]:
#显示调用方法
print([attr for attr in dir(s) if not attr.startswith('_')])

['T', 'a', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'argmax', 'argmin', 'argsort', 'array', 'asfreq', 'asof', 'astype', 'at', 'at_time', 'attrs', 'autocorr', 'axes', 'b', 'between', 'between_time', 'bfill', 'bool', 'c', 'clip', 'combine', 'combine_first', 'convert_dtypes', 'copy', 'corr', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'd', 'describe', 'diff', 'div', 'divide', 'divmod', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtype', 'dtypes', 'duplicated', 'e', 'empty', 'eq', 'equals', 'ewm', 'expanding', 'explode', 'factorize', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'floordiv', 'ge', 'get', 'groupby', 'gt', 'hasnans', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'interpolate', 'is_monotonic', 'is_monotonic_decreasing', 'is_monotonic_increasing', 'is_unique', 'isin', 'isna', 'isnull', 'item', 'items', 'iteritems', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lt', 'mad', 'map', 'mask', 'max', 'mean', 'median', 'memory_usage', 'min', 'mod', 'mode', 'mul', 'multiply', 'name', 'nbytes', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pct_change', 'pipe', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'radd', 'rank', 'ravel', 'rdiv', 'rdivmod', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'repeat', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'searchsorted', 'sem', 'set_axis', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'std', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_frame', 'to_hdf', 'to_json', 'to_latex', 'to_list', 'to_markdown', 'to_numpy', 'to_period', 'to_pickle', 'to_sql', 'to_string', 'to_timestamp', 'to_xarray', 'transform', 'transpose', 'truediv', 'truncate', 'tshift', 'tz_convert', 'tz_localize', 'unique', 'unstack', 'update', 'value_counts', 'values', 'var', 'view', 'where', 'xs']

### DataFrame

In [13]:
df = pd.DataFrame({'col1':list('abcde'),'col2':range(5,10),'col3':[1.4,1.3,3,5.4,2.3]},index=list('一二三四五'))
df

  col1  col2  col3
一    a     5   1.4
二    b     6   1.3
三    c     7   3.0
四    d     8   5.4
五    e     9   2.3

In [14]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
type(df['col2'])

pandas.core.series.Series

In [17]:
df.rename(index={'一':'one'},columns={'col1':'col_one'})

    col_one  col2  col3
one       a     5   1.4
二         b     6   1.3
三         c     7   3.0
四         d     8   5.4
五         e     9   2.3

In [18]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [19]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [20]:
df.values

array([['a', 5, 1.4],
       ['b', 6, 1.3],
       ['c', 7, 3.0],
       ['d', 8, 5.4],
       ['e', 9, 2.3]], dtype=object)

In [21]:
df.shape

(5, 3)

In [22]:
df.mean()

col2    7.00
col3    2.68
dtype: float64

调用属性和方法

In [23]:
df1=pd.DataFrame({'A':[1,2,3]},index=[1,2,3])
df2=pd.DataFrame({'A':[1,2,3]},index=[3,2,1])

In [24]:
df1-df2

   A
1 -2
2  0
3  2

pop函数 返回被删除的列

In [25]:
df['col1']=[1,2,3,4,5]
df.pop('col1')

一    1
二    2
三    3
四    4
五    5
Name: col1, dtype: int64

In [26]:
df

   col2  col3
一     5   1.4
二     6   1.3
三     7   3.0
四     8   5.4
五     9   2.3

增加新列

In [27]:
df1['B']=list('abc')
df1

   A  B
1  1  a
2  2  b
3  3  c

In [28]:
df1.assign(C=pd.Series(list('def')))

   A  B    C
1  1  a    e
2  2  b    f
3  3  c  NaN

In [29]:
df1.assign(C=pd.Series(list('1234')))

   A  B  C
1  1  a  2
2  2  b  3
3  3  c  4

assign函数可以直接进行数组计算 不会对原DataFrame做修改

In [30]:
df1.assign(C=lambda x:x['A']*2)

   A  B  C
1  1  a  2
2  2  b  4
3  3  c  6

In [31]:
#根据类型选择
df.select_dtypes(include=['number']).head()

   col2  col3
一     5   1.4
二     6   1.3
三     7   3.0
四     8   5.4
五     9   2.3

In [32]:
#将Seris转换为DataFrame
s = df.mean()
s.name='to_DataFrame'
s

col2    7.00
col3    2.68
Name: to_DataFrame, dtype: float64

In [33]:
s.to_frame().T

              col2  col3
to_DataFrame   7.0  2.68

## 常用基本函数

### 基础函数

In [34]:
df=pd.read_csv('data/table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [35]:
df.shape

(35, 9)

In [36]:
#显示有多少唯一值
df['Physics'].nunique()

7

In [37]:
#显示所有唯一值
df['Physics'].unique()

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

In [38]:
#返回非缺失值元素个数
df['Physics'].count()

35

In [39]:
df['Physics'].value_counts()

B+    9
B     8
B-    6
A     4
A+    3
A-    3
C     2
Name: Physics, dtype: int64

In [40]:
#统计数值型数据的各个统计量
df.describe()
#选择分位数
df.describe(percentiles=[.05, .25, .75, .95])

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
5%     1102.70000  157.000000   56.100000  32.640000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
95%    2403.30000  193.300000   97.600000  90.040000
max    2405.00000  195.000000  100.000000  97.000000

In [41]:
#idxmax 返回最大值所在索引 最小值 idxmin
df['Math'].idxmax()

5

In [42]:
#返回前几个大元素值 nsmallest
df['Math'].nlargest(3)

5     97.0
28    95.5
11    87.7
Name: Math, dtype: float64

In [43]:
#对超过或低于某些值的数进行截断
df['Math'].clip(33.80).head()

0    34.0
1    33.8
2    87.2
3    80.4
4    84.8
Name: Math, dtype: float64

In [44]:
df['Math'].mad() #平均绝对偏差

16.924244897959188

In [45]:
#对某些值进行替换
df['Address'].replace(['street_1','street_2'],['one','two']).head()

0         one
1         two
2         two
3         two
4    street_4
Name: Address, dtype: object

replace函数通过字典 可以直接在表中修改

In [46]:
df.replace({'Address':{'street_1':'one','street_2':'two'}}).head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M       one     173      63  34.0      A+
1    S_1   C_1  1102      F       two     192      73  32.5      B+
2    S_1   C_1  1103      M       two     186      82  87.2      B+
3    S_1   C_1  1104      F       two     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

apply函数 自由度很高

In [47]:
#对于Series 可以迭代每一列的值操作
df['Math'].apply(lambda x:str(x)+'!').head()

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

In [48]:
#对于DaraFrame 如默认axis=0 可以迭代每一个列操作
df.apply(lambda x:x.apply(lambda x:str(x)+'!')).head()

  School Class     ID Gender    Address Height Weight   Math Physics
0   S_1!  C_1!  1101!     M!  street_1!   173!    63!  34.0!     A+!
1   S_1!  C_1!  1102!     F!  street_2!   192!    73!  32.5!     B+!
2   S_1!  C_1!  1103!     M!  street_2!   186!    82!  87.2!     B+!
3   S_1!  C_1!  1104!     F!  street_2!   167!    81!  80.4!     B-!
4   S_1!  C_1!  1105!     F!  street_4!   159!    64!  84.8!     B+!

- Pandas中的axis参数=0时，永远表示的是处理方向而不是聚合方向，当axis='index'或=0时，对列迭代对行聚合，行即为跨列，axis=1同理

### 排序

In [49]:
#set_index函数可以设置索引
df.set_index('Class').head()

      School    ID Gender   Address  Height  Weight  Math Physics
Class
C_1      S_1  1101      M  street_1     173      63  34.0      A+
C_1      S_1  1102      F  street_2     192      73  32.5      B+
C_1      S_1  1103      M  street_2     186      82  87.2      B+
C_1      S_1  1104      F  street_2     167      81  80.4      B-
C_1      S_1  1105      F  street_4     159      64  84.8      B+

In [50]:
df.set_index('ID').sort_index().head() #可以设置ascending参数，默认为升序，True

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [51]:
df.sort_values(by='Class').head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
15    S_2   C_1  2101      M  street_7     174      84  83.3       C

In [52]:
#值排序
df.sort_values(by='Height').head()
#多值排序
df.sort_values(by=['Height','Weight']).head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
22    S_2   C_2  2203      M  street_4     155      91  73.8      A+
17    S_2   C_1  2103      M  street_4     157      61  52.5      B-
25    S_2   C_3  2301      F  street_4     157      78  72.3      B+
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
4     S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [53]:
GOT=pd.read_csv('data/Game_of_Thrones_Script.csv')
GOT.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence
0,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,What do you expect? They're savages. One lot s...
1,2011/4/17,Season 1,Episode 1,Winter is Coming,will,I've never seen wildlings do a thing like this...
2,2011/4/17,Season 1,Episode 1,Winter is Coming,waymar royce,How close did you get?
3,2011/4/17,Season 1,Episode 1,Winter is Coming,will,Close as any man would.
4,2011/4/17,Season 1,Episode 1,Winter is Coming,gared,We should head back to the wall.

In [54]:
GOT.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23911 entries, 0 to 23910
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Release Date   23911 non-null  object
 1   Season         23911 non-null  object
 2   Episode        23911 non-null  object
 3   Episode Title  23911 non-null  object
 4   Name           23911 non-null  object
 5   Sentence       23911 non-null  object
dtypes: object(6)
memory usage: 1.1+ MB

In [55]:
GOT['Name'].nunique()

564

In [56]:
GOT['Name'].value_counts()

tyrion lannister      1760
jon snow              1133
daenerys targaryen    1048
cersei lannister      1005
jaime lannister        945
                      ...
dolorous                 1
survivor                 1
lhara                    1
main                     1
ser vance                1
Name: Name, Length: 564, dtype: int64

In [57]:

got_word = GOT.assign(Words=GOT['Sentence'].apply(lambda x:len(x.split()))).sort_values(by='Name')
got_word.head()

,Release Date,Season,Episode,Episode Title,Name,Sentence,Words
276,2011/4/17,Season 1,Episode 1,Winter is Coming,a voice,"It's Maester Luwin, my lord.",5
3012,2011/6/19,Season 1,Episode 10,Fire and Blood,addam marbrand,ls it true about Stannis and Renly?,7
3017,2011/6/19,Season 1,Episode 10,Fire and Blood,addam marbrand,Kevan Lannister,2
13610,2014/6/8,Season 4,Episode 9,The Watchers on the Wall,aemon,And what is it that couldn't wait until mornin...,10
13614,2014/6/8,Season 4,Episode 9,The Watchers on the Wall,aemon,"Oh, no need. I know my way around this library...",48

In [58]:
L_count = []
N_words = list(zip(got_word['Name'],got_word['Words']))
for i in N_words:
    if i == N_words[0]:
        L_count.append(i[1])
        last = i[0]
    else:
        L_count.append(L_count[-1]+i[1] if i[0] == last else i[1])
        last = i[0]
got_word['Count']=L_count
got_word['Name'][got_word['Count'].idxmax()]

'tyrion lannister'

# 索引

## 单级索引
最常用的索引方法可能就是这三类，其中iloc表示位置索引，loc表示标签索引，[ ]也具有很大的便利性，各有特点

### loc

In [59]:
df = pd.read_csv('data/table.csv',index_col='ID')
df.head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 35 entries, 1101 to 2405
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   35 non-null     object
 1   Class    35 non-null     object
 2   Gender   35 non-null     object
 3   Address  35 non-null     object
 4   Height   35 non-null     int64
 5   Weight   35 non-null     int64
 6   Math     35 non-null     float64
 7   Physics  35 non-null     object
dtypes: float64(1), int64(2), object(5)
memory usage: 3.7+ KB

In [60]:
#多行索引
df.loc[1302:2100].head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1302    S_1   C_3      F  street_1     175      57  87.7      A-
1303    S_1   C_3      M  street_7     188      82  49.7       B
1304    S_1   C_3      M  street_2     195      70  85.2       A
1305    S_1   C_3      F  street_5     187      69  61.7      B-

In [61]:
df.loc[::-1].head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
2405    S_2   C_4      F  street_6     193      54  47.6       B
2404    S_2   C_4      F  street_2     160      84  67.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2402    S_2   C_4      M  street_7     166      82  48.7       B
2401    S_2   C_4      F  street_2     192      62  45.3       A

In [63]:
#列索引
df.loc[:,['Height','Math']].head()

      Height  Math
ID
1101     173  34.0
1102     192  32.5
1103     186  87.2
1104     167  80.4
1105     159  84.8

In [70]:
#联合索引
df.loc[1103:2401,'Height':'Physics'].head()

      Height  Weight  Math Physics
ID
1103     186      82  87.2      B+
1104     167      81  80.4      B-
1105     159      64  84.8      B+
1201     188      68  97.0      A-
1202     176      94  63.5      B-

In [73]:
#函数索引
#loc中使用的函数，传入参数
df.loc[lambda x:x['Address']=='street_6'].head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1205    S_1   C_2      F  street_6     167      63  68.4      B-
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2304    S_2   C_3      F  street_6     164      81  95.5      A-
2403    S_2   C_4      F  street_6     158      60  59.7      B+

In [75]:
#布尔索引
df.loc[df['Class'].isin(['C_2','C_4'])]

     School Class Gender   Address  Height  Weight  Math Physics
ID
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1203    S_1   C_2      M  street_6     160      53  58.8      A+
1204    S_1   C_2      F  street_5     162      63  33.8       B
1205    S_1   C_2      F  street_6     167      63  68.4      B-
2201    S_2   C_2      M  street_5     193     100  39.1       B
2202    S_2   C_2      F  street_7     194      77  68.5      B+
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2204    S_2   C_2      M  street_1     175      74  47.2      B-
2205    S_2   C_2      F  street_7     183      76  85.4       B
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

In [77]:
df.loc[[True if i[-1]=='4' or i[-1]=='5' else False for i in df['Address'].values]]

     School Class Gender   Address  Height  Weight  Math Physics
ID
1105    S_1   C_1      F  street_4     159      64  84.8      B+
1201    S_1   C_2      M  street_5     188      68  97.0      A-
1202    S_1   C_2      F  street_4     176      94  63.5      B-
1204    S_1   C_2      F  street_5     162      63  33.8       B
1301    S_1   C_3      M  street_4     161      68  31.5      B+
1305    S_1   C_3      F  street_5     187      69  61.7      B-
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A
2201    S_2   C_2      M  street_5     193     100  39.1       B
2203    S_2   C_2      M  street_4     155      91  73.8      A+
2301    S_2   C_3      F  street_4     157      78  72.3      B+
2302    S_2   C_3      M  street_5     171      88  32.7       A
2305    S_2   C_3      M  street_4     187      73  48.9       B

- 小节：本质上说，loc中能传入的只有布尔列表和索引子集构成的列表，只要把握这个原则就很容易理解上面那些操作

### iloc方法 
不包含切片右端点

In [83]:
#单列切片
df.iloc[:,3].head()

ID
1101    street_1
1102    street_2
1103    street_2
1104    street_2
1105    street_4
Name: Address, dtype: object

In [92]:
#多列切片
df.iloc[:5,::2]

     School Gender  Height  Math
ID
1101    S_1      M     173  34.0
1102    S_1      F     192  32.5
1103    S_1      M     186  87.2
1104    S_1      F     167  80.4
1105    S_1      F     159  84.8

In [ ]:
#函数式切片